In [1]:
#conditional probability:--- P(B/A)*P(A)/P(B)

In [2]:
#For TITANIC dataset
#p(survived/male & class & age & cabin & fare)

In [3]:
#Make a NAIVE assumption that features such as male,class,age,cabin,fare etcare independent of each other.

In [4]:
#Naive Bayes used for: Spam email detection,weather prediction,hand digits charcter identification,face recognization,news
#--article seperation.

In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [6]:
df=pd.read_csv(r'E:\py\py-master\ML\14_naive_bayes\titanic.csv')

In [7]:
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [8]:
df=df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns')

In [9]:
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [11]:
target=df.Survived
inputs=df.drop('Survived',axis='columns')

In [13]:
dummies=pd.get_dummies(inputs.Sex)

In [14]:
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [17]:
merged=pd.concat([inputs,dummies],axis='columns')

In [18]:
merged

     Pclass     Sex   Age     Fare  female  male
0         3    male  22.0   7.2500       0     1
1         1  female  38.0  71.2833       1     0
2         3  female  26.0   7.9250       1     0
3         1  female  35.0  53.1000       1     0
4         3    male  35.0   8.0500       0     1
..      ...     ...   ...      ...     ...   ...
886       2    male  27.0  13.0000       0     1
887       1  female  19.0  30.0000       1     0
888       3  female   NaN  23.4500       1     0
889       1    male  26.0  30.0000       0     1
890       3    male  32.0   7.7500       0     1

[891 rows x 6 columns]

In [24]:
merged=merged.drop('Sex',axis='columns')

In [25]:
merged.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [28]:
merged.isna().any()

Pclass    False
Age        True
Fare      False
female    False
male      False
dtype: bool

In [30]:
merged.Age=merged.Age.fillna(merged.Age.mean())

In [31]:
merged.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [32]:
merged.isna().any()

Pclass    False
Age       False
Fare      False
female    False
male      False
dtype: bool

In [33]:
from sklearn.model_selection import train_test_split

In [34]:
x_train,x_test,y_train,y_test=train_test_split(merged,target,test_size=0.2)

In [35]:
len(x_train)

712

In [36]:
len(x_test)

179

In [38]:
from sklearn.naive_bayes import GaussianNB
#gaussian NB is used when the data distribution is normal.

In [39]:
model=GaussianNB()

In [40]:
model.fit(x_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [41]:
model.score(x_test,y_test)

0.7318435754189944

In [42]:
x_test[:10]

     Pclass        Age      Fare  female  male
399       2  28.000000   12.6500       1     0
889       1  26.000000   30.0000       0     1
762       3  20.000000    7.2292       0     1
847       3  35.000000    7.8958       0     1
373       1  22.000000  135.6333       0     1
398       2  23.000000   10.5000       0     1
324       3  29.699118   69.5500       0     1
457       1  29.699118   51.8625       1     0
572       1  36.000000   26.3875       0     1
656       3  29.699118    7.8958       0     1

In [43]:
y_test[:10]

399    1
889    1
762    1
847    0
373    0
398    0
324    0
457    1
572    1
656    0
Name: Survived, dtype: int64

In [44]:
model.predict(x_test[:10])

array([1, 0, 0, 0, 1, 0, 0, 1, 0, 0], dtype=int64)

In [45]:
model.predict_proba(x_test[:10])

array([[0.01961215, 0.98038785],
       [0.93763675, 0.06236325],
       [0.99092866, 0.00907134],
       [0.99206603, 0.00793397],
       [0.08895301, 0.91104699],
       [0.98123382, 0.01876618],
       [0.97708656, 0.02291344],
       [0.00375099, 0.99624901],
       [0.94351454, 0.05648546],
       [0.99179629, 0.00820371]])